a=input("Введите первый цвет: \n")
b=input("Введите второй цвет: \n")
if (a == "красный" or a == "синий" or a == "желтый") and (b == "красный" or b == "синий" or b == "желтый"):
    if a == "красный" and b == "синий" or a == "синий" and b == "красный":
        print("Фиолетовый")
    if a == "желтый" and b == "синий" or a == "синий" and b == "желтый":
        print("Зелёный")
    if a == "красный" and b == "жёлтый" or a == "жёлтый" and b == "красный":
        print("Оранжевый")
else:
    print("ошибка")